app/Controllers/Back/Pasien.php

SELECT *
FROM `tbl_pasien`
WHERE `tbl_pasien`.`id_pasien` = '23'
---
    public function detail($id_pasien)
    {

        $row = $this->Pasien->find($id_pasien);