app/Controllers/Back/Rm.php

SELECT *
FROM `tbl_pasien`
WHERE `tbl_pasien`.`id_pasien` = '23'
---
    public function formtambah($id_pasien)
    {
        if ($this->request->isAJAX()) {

            $row = $this->Pasien->find($id_pasien);