app/Views/Page/Beranda.php

SELECT COUNT(*) AS `numrows`
FROM `tbl_pasien`
SELECT COUNT(*) AS `numrows`
FROM `tbl_obat`
SELECT COUNT(*) AS `numrows`
FROM `tbl_riwayat_transaksi`
SELECT COUNT(*) AS `numrows`
FROM `tbl_user`
---
$level = $session->get('level');
$nama = $session->get('nama_user');
$this->db = \config\Database::connect();
$pasien = $this->db->table('tbl_pasien')->countAllResults();
$obat = $this->db->table('tbl_obat')->countAllResults();
$transaksi = $this->db->table('tbl_riwayat_transaksi')->countAllResults();
$pengguna = $this->db->table('tbl_user')->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tbl_kunjungan`
---
                <div class="d-flex flex-row">
                    <div style="text-align: center; font-weight:bold;" class="col-12 align-self-center">
                        <?php
                            $kunjungan = $this->db->table('tbl_kunjungan')->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tbl_riwayat_transaksi`
WHERE `total_bayar` = ''
---

                            $this->db = \config\Database::connect();
                            $total_bayar = 'total_bayar';
                            $dataantrian = $this->db->table('tbl_riwayat_transaksi')->select('*')->where($total_bayar, '')->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tbl_kunjungan`
---
                    <div style="text-align: center; font-weight:bold;" class="col-12 align-self-center">
                        <?php

                            $kunjungan = $this->db->table('tbl_kunjungan')->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tbl_kunjungan`
---
                    <div style="text-align: center; font-weight:bold;" class="col-12 align-self-center">
                        <?php

                            $kunjungan = $this->db->table('tbl_kunjungan')->countAllResults();